       IDENTIFICATION DIVISION.
       PROGRAM-ID. loop-test.
       AUTHOR. JOÃO LOPES.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
           SPECIAL-NAMES.
      
               DECIMAL-POINT IS COMMA.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
           01 COUNTER  PIC 9(2) VALUE ZEROS.

       PROCEDURE DIVISION.

           PERFORM LOOP-PROCESS.
       LOOP-PROCESS.
           PERFORM VARYING COUNTER FROM 1 BY 1 
           UNTIL COUNTER GREATER THAN 5
               DISPLAY "NUMBER: " COUNTER
           END-PERFORM
           GOBACK.
